# 2) ჩამოწერეთ 10 მაგალითი თითოეულ ოპერაციაზე: +=, -=, *=, /=
print(1+=1:)
print(1+=2:)
print(2+=2:)
print(2+=3:)
print(3+=3:)
print(3+=4:)
print(4+=4:)
print(4+=5:)
print(5+=5:)                                              
print(5+=6:)
print(6-=7:)
print(7-=7:)                             
print(7-=8:)                                                                                                        
print(8-=8:)   
print(8-=9:)                                                                            
print(9-=9:)
print(9-=10:)                                                     
print(10-=10:)                                             
print(10-=11;)                                            
print(11-=11:)                                         
print(11-=12:)                                                                                          
print(1*=1:)
print(1*=2:)
print(2*=2:)
print(2*=3:)
print(3*=3:)
print(3*=4:)
print(4*=4:)
print(4*=5:)
print(5*=5:)
print(5*=6:)
print(6/=6)
print(6/=7)
print(7/=7)
print(7/=8)
print(8/=8)
print(8/=9)
print(9/=9)
print(9/=10)
print(10/=10)
print(10/=11)

# 3) თქვენი სიტყვებით ახსენით როგორ მუშაობს მეტია ან ტოლია (>=), ნაკლებია ან ტოლია (<=)
# მეტია და ტოლია არის მაგალითად ცვლადებში რაც გაქვს შნახული იმას მიუთითო მაგალითად print(num 1 <= num 2) იგივეა ნაკლებლობაზე ან ტოლიაზე.

# 4) თქვენი სიტყვებით ახსენით როგორ მუშაობს პირობითი განცხადებები. გააკეთეთ მარტივი flowchart (ბლოკ-სქემა) რამე მაგალითზე
# როცა დაწრთ პირობით განცხადებას მაშინ თუ არასწორი გექნებათ კოდში დაწერილი მაშინ გამოგიტანთ იმას რაც პირობით განცხადებაში გიწერიათ იმას გამოგიგდებთ.

# 6) მომხმარებელს შემოატანინე რიცხვი და შეინახე მთელი რიცხვის სახით.

# თუ ეს რიცხვი მეტია 100-ზე, დაბეჭდე "big number",
# სხვა შემთხვევაში დაბეჭდე "small number"
user_number = int(input("Enter your number: "))
if user_number > 10:
    print("Bigger than 100")
else:
    print("Smaller than 100")